//알레르기 상수 매핑 함수

export const ALLERGY_NAMES = [
  "우유","대두","메밀","땅콩","밀","생선","게","새우","돼지고기","복숭아",
  "토마토","아황산염","호두","닭고기","쇠고기","오징어","조개류","잣","키위","달걀",
  "아몬드","캐슈넛","피스타치오","마카다미아","헤이즐넛","브라질너트","해바라기씨","참깨","양귀비씨","호박씨",
  "옥수수","쌀","귀리","보리","호밀","콩(강낭콩)","렌틸콩","병아리콩","녹두","밀가루",
  "사과","바나나","포도","오렌지","레몬","딸기","파인애플","아보카도","망고","멜론",
  "배","자두","체리","블루베리","라즈베리","감자","당근","샐러리","양파","마늘",
  "생강","아스파라거스","버섯","파","시금치","양배추","브로콜리","파프리카","고추","가지",
  "효모","식용 색소(타르트라진)","MSG (L-글루탐산나트륨)","아질산염","젤라틴","코코아","바닐라","커피","차(카페인)","술/주정",
  "카라멜 색소","인공 감미료","방부제","유화제","팜유","후추","계피","올리브","무","배추",
  "호박","허브(딜)","허브(바질)","허브(오레가노)","허브(파슬리)","허브(로즈마리)","오리알","메추리알","염소고기","오리고기",
  "메추리고기","아티초크","케이퍼","피클","밤",
];

//id는 1부터 시작임
export const ALLERGY_NAME_TO_ID = ALLERGY_NAMES.reduce((acc, name, idx) => {
  acc[name] = idx + 1;
  return acc;
}, {});
